Courses/4420/Lectures/Hardening/Fortification/fortify-lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lab: Fortification of a Linux Installation</title>
<!-- 2018-08-26 Sun 10:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Fortification of a Linux Installation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Educational Objectives</a></li>
<li><a href="#sec-2">2. Tasks</a>
<ul>
<li><a href="#sec-2-1">2.1. Task: Examine suid Programs</a></li>
<li><a href="#sec-2-2">2.2. Task: Prune Installed Software</a></li>
<li><a href="#sec-2-3">2.3. Task: File System Audit</a></li>
<li><a href="#sec-2-4">2.4. Task: Log  Analyses</a></li>
<li><a href="#sec-2-5">2.5. Task: Rewriting SUID Scripts as SUID Programs</a></li>
<li><a href="#sec-2-6">2.6. Task: Forensics</a></li>
<li><a href="#sec-2-7">2.7. Task: Audit System</a></li>
<li><a href="#sec-2-8">2.8. Task: OpenSCAP</a></li>
<li><a href="#sec-2-9">2.9. Task: Lynis</a></li>
<li><a href="#sec-2-10">2.10. Task: Rootkit Detection</a></li>
<li><a href="#sec-2-11">2.11. Task: [Devious] [Bonus] Rootkit Installation</a></li>
</ul>
</li>
<li><a href="#sec-3">3. References</a></li>
<li><a href="#sec-4">4. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Educational Objectives</h2>
<div class="outline-text-2" id="text-1">
<p>
This lab deals with a few fortification steps, postponing hardening to
later labs.
</p>

<ol class="org-ol">
<li>Recognize that out of the box installations of OS need both pruning
and grafting.
</li>
<li>Examine a Linux installation for what needs to be pruned.  Reducing
the installed footprint is considered a reduction of attack
surface.
</li>
<li>We also need to be proactive in observing suspicious events and
take action.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Task: Examine suid Programs</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>TBD Configure /etc/sudoers
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Task: Prune Installed Software</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Take stock of what software is installed.  
</li>
<li>Starting from TBD LXU of previous lab, uninstall at least two packages,
without breaking the installation.  Imagine that LXU is intended
for use only in supposrt of this course.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Task: File System Audit</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Objective: Experience a file system audit tool.
</p>

<ol class="org-ol">
<li>"Tripwire is a policy driven file system integrity checking tool."
That is, it can detect changes in various (config) files and
report. Alternate tools: AIDE, OSSEC.
</li>

<li>Install the package tripwire. <code>apt install tripwire</code>
</li>

<li>Build the database following the instructions found in the 
package.
</li>

<li>Select and modify a few &amp;quot;system&amp;quot; files from directories such as 
/bin, /sbin, /usr/sbin and /etc.
</li>

<li>Observe and explain tripwire's reports.
</li>
<li>Install and experience a tool that analyzes log reports (usually in
<i>var/log</i>).
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Task: Log  Analyses</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Linux records various logs in <code>/var/log/*</code>.  There is a log
rotation system.  To be aware of the logs manually is a tedious
task.  There are several log analyses tools that help.  See e.g.,
<ol class="org-ol">
<li><a href="https://www.tecmint.com/best-linux-log-monitoring-and-management-tools/">https://www.tecmint.com/best-linux-log-monitoring-and-management-tools/</a>
</li>
<li><a href="http://www.pinoylinux.org/system-adminstration/open-source-sysadmin-resources/">http://www.pinoylinux.org/system-adminstration/open-source-sysadmin-resources/</a>
      Monitoring and Security sections
</li>
</ol>
</li>

<li>TBD
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Task: Rewriting SUID Scripts as SUID Programs</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Discover all suid scripts (not binaries) on LXU.
</li>
<li>Carefully analyze and report the need for each of these.
</li>
<li>Rewrite the suid scripts into C/C++ programs.
</li>
<li>Does rewriting scripts into programs improve security?  Discuss.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Task: Forensics</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>Install a forensic tool and experience it.
</li>

<li>TBD
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Task: Audit System</h3>
<div class="outline-text-3" id="text-2-7">
<ol class="org-ol">
<li>Install the monitoring tool: <code>apt install auditd</code> and then reaad
<code>man auditd</code> For an example ruleset, read
<a href="https://security.stackexchange.com/questions/4629/">https://security.stackexchange.com/questions/4629/</a> BTW the auditd
package ships with some example configuration files based on a few
standards. They can be found at <i>usr/share/doc/auditd/examples</i>. Of
course you will still want to tailor them for your individual
needs. – Jon-Erik Aug 14 '14 at 15:51
</li>

<li>TBD
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Task: OpenSCAP</h3>
<div class="outline-text-3" id="text-2-8">
<ol class="org-ol">
<li>"Security compliance is a state where computer systems are in line
with a specific security policy."
</li>

<li><a href="https://www.open-scap.org/getting-started/">https://www.open-scap.org/getting-started/</a> "&#x2026;  new
vulnerabilities are being discovered and patched every day,
enforcing security compliance must be a continuous process.  It
also needs to include a way to make adjustments to policies, as
well as periodic assessment and risk monitoring.  The OpenSCAP
ecosystem provides tools and customizable policies for a quick,
cost-effective and flexible implementation of such a process."
</li>

<li>Install OpenSCAP Base.
</li>

<li>TBD
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Task: Lynis</h3>
<div class="outline-text-3" id="text-2-9">
<ol class="org-ol">
<li><a href="https://cisofy.com/documentation/lynis/">https://cisofy.com/documentation/lynis/</a> Security auditing, system
hardening, and compliance monitoring.  Use the free community
version.
</li>

<li>TBD
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Task: Rootkit Detection</h3>
<div class="outline-text-3" id="text-2-10">
<ol class="org-ol">
<li>Linux systems have not generally experienced virus attacks.  But,
worm attacks, backdoors and rootkits have happened enough times.
</li>

<li>Defend your LXU by installing a rootkit detector and schedule its
runs periodically.
</li>

<li>Ex: chkrootkit, rkhunter
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> Task: [Devious] [Bonus] Rootkit Installation</h3>
<div class="outline-text-3" id="text-2-11">
<ol class="org-ol">
<li><a href="https://packetstormsecurity.com/">https://packetstormsecurity.com/</a> is a whitehat site that hosts the
sources of several exploits and attacks for research.
</li>

<li>Find a rootkit source package and make it work within LXU.
</li>

<li>E.g., Vlany is a Linux 2016 rootkit "that provides process hiding,
user hiding, network hiding, LXC container, anti-debug,
anti-forensics, persistent reinstalls, dynamic linker
modifications, backdoors, and more."
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../HardenOS/Fortification/">../HardenOS/Fortification/</a> 2018. Required Reading.
</li>
<li>Prabhaker Mateti, <a href="../RootKits/index.html">RootKits</a>.  2017. Required Reading.
</li>

<li>Wietse Venema, <a href="http://www.porcupine.org/">http://www.porcupine.org/</a>.  Forensics, and other
Tools.  {pm: Old but Gold} Required Visit.
</li>

<li>wikipedia.org,
<a href="http://en.wikipedia.org/wiki/Category:Linux_security_software">http://en.wikipedia.org/wiki/Category:Linux_security_software</a> 2018.
Required Visit.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-08-26
</div>
</body>
</html>
